{
    "text" : [
    {
        "text": "I don't know if it gets much better than this barbecue chicken recipe.",
        "stamp": 330
    },
    {
        "text": "When it comes to summertime grilling, you've got juicy and meaty chicken pieces slathered in a sweet and spicy barbecue sauce.",
        "stamp": 3402
    },
    {
        "text": "And when people say a recipe is finger looking good, they are absolutely referring to this one, because you're gonna have barbecue sauce all over your fingers.",
        "stamp": 10810
    },
    {
        "text": "But unlike burger patties or hot dogs that are easy to grill with just one flip, there are a few tricks that you need to know in order to grill the best barbecue chicken.",
        "stamp": 18810
    },
    {
        "text": "And that's what I'm going to share with you today.",
        "stamp": 27026
    },
    {
        "text": "So let's get started.",
        "stamp": 29020
    },
    {
        "text": "I recommend that you use bone in skin on chicken for this recipe, as it'll keep the chicken super moist and juicy on the inside, and you can opt for your favorite chicken pieces.",
        "stamp": 31050
    },
    {
        "text": "Today, I'm using a combination of chicken thighs and a drumsticks just so that there's a little variety, and you'll need about three and a half to four pounds total, which is about twelve to 14 pieces.",
        "stamp": 41942
    },
    {
        "text": "Bring the chicken to room temperature so it's not overly cold from the fridge, and I just place it on a baking sheet as it's easy to season that way, which you'll see here in a second.",
        "stamp": 53390
    },
    {
        "text": "But first, pat the chicken dry with a paper towel, as there will usually be little beads of moisture on the surface as it comes to room temperature.",
        "stamp": 63268
    },
    {
        "text": "To make the best barbecue chicken, you'll season the chicken two ways, first with a dry rub and then with barbecue sauce, as this gives the chicken the most flavor.",
        "stamp": 71294
    },
    {
        "text": "To make the dry rub, add one teaspoon of kosher salt to a bowl, along with one teaspoon of garlic powder, one teaspoon of smoked paprika, one teaspoon of chili powder, one teaspoon of onion powder, and half a teaspoon of ground black pepper.",
        "stamp": 80690
    },
    {
        "text": "Give that a stir to mix it together and then sprinkle it all over the chicken.",
        "stamp": 95510
    },
    {
        "text": "I use a spoon to generously pile the rub on top of the chicken pieces, but then you're going to want to dig in and use your hands to rub it all over, making sure to loosen the skin and get some of those spices under the skin and on the bottom side as well.",
        "stamp": 99766
    },
    {
        "text": "Essentially, you want the chicken pieces totally covered in dried spices, and then you can just let the spices sit on the chicken and marinate while you make my homemade barbecue sauce.",
        "stamp": 114468
    },
    {
        "text": "Now, of course, you can use your favorite storebought barbecue sauce for this recipe, but if you don't want junkie ingredients like corn syrup, processed sugar and dyes, I say you make my version, which is the perfect balance of sweet, smoky and spicy.",
        "stamp": 125150
    },
    {
        "text": "To make the barbecue sauce, add 115 ounce can of tomato sauce to a saucepan, along with one third cup of apple cider vinegar, one third cup of black strap molasses, which is also going to sweeten it naturally.",
        "stamp": 140750
    },
    {
        "text": "A quarter cup of tomato paste, one tablespoon of tamari, soy sauce or coconut aminos or Worcestershire sauce.",
        "stamp": 154074
    },
    {
        "text": "If you opt to use Worcestershire sauce, just watch the ingredients, as many of them aren't gluten free.",
        "stamp": 162266
    },
    {
        "text": "Then add two teaspoons of mustard powder, two teaspoons of smoked paprika, and definitely use smoked paprika and not sweet paprika, one teaspoon of garlic powder, half a teaspoon of onion powder, half a teaspoon of kosher salt, and half a teaspoon of ground black pepper.",
        "stamp": 167976
    },
    {
        "text": "Give that a stir to mix it all together and it should turn a deep dark color from the molasses.",
        "stamp": 186090
    },
    {
        "text": "I find so many barbecue sauce recipes that are bright red and a combination of just ketchup with spices, and trust me, that is not what you want.",
        "stamp": 191442
    },
    {
        "text": "For the best barbecue sauce, bring this to a boil until it just starts bubling.",
        "stamp": 199712
    },
    {
        "text": "Give it a stir and then reduce the heat to low for a gentle simmer.",
        "stamp": 204550
    },
    {
        "text": "Let it simmer for about ten minutes, stirring it occasionally.",
        "stamp": 208842
    },
    {
        "text": "Now heads up you don't want to fully walk away because it does have a tendency to splatter.",
        "stamp": 212538
    },
    {
        "text": "So keep an eye on it in case you need to reduce the temperature even more or move it to a smaller burner.",
        "stamp": 217662
    },
    {
        "text": "The great thing about this recipe is that it's so easy to tweak to your personal preferences.",
        "stamp": 223710
    },
    {
        "text": "If you like a sweeter barbecue sauce, you could always add a couple tablespoons of honey, and if you like it spicier, you could add a pinch of cayenne pepper or a few dashes of hot sauce.",
        "stamp": 228270
    },
    {
        "text": "Personally, I love this barbecue sauce just how it is, but you do you.",
        "stamp": 238066
    },
    {
        "text": "All right, let's get to grilling.",
        "stamp": 243870
    },
    {
        "text": "In order to make the best barbecue chicken on the grill, you'll need two zones of heat direct heat and indirect heat, with the chicken cooking low and slow over the indirect heat.",
        "stamp": 246310
    },
    {
        "text": "So to do that, turn the burners on half of your grill to high and keep the other half off.",
        "stamp": 257194
    },
    {
        "text": "If you've got three burners, as I do today, I'm turning two of them on and leaving the middle section off, which is my indirect heat zone.",
        "stamp": 262676
    },
    {
        "text": "Lightly oil the grate with avocado oil or another high heat oil, and you can do this by moistening some paper towels in the oil and then using long handled tongs to coat the grate, and this just helps ensure that the chicken pieces won't stick to the grill.",
        "stamp": 270990
    },
    {
        "text": "Place the chicken on your indirect zone of heat and make sure there's enough space between the pieces for good airflow.",
        "stamp": 284706
    },
    {
        "text": "For the twelve pieces of chicken I have today, I can fit two perfect rows of six pieces each, but the size of your grill may be different.",
        "stamp": 290962
    },
    {
        "text": "And once you've got the chicken all on the grill, close the lid.",
        "stamp": 298112
    },
    {
        "text": "You'll cook the chicken for about 30 to 35 minutes, flipping it every ten minutes or so.",
        "stamp": 301238
    },
    {
        "text": "You'll notice that the first couple of times you flip the chicken, there's not a lot of color on it, but in the last five to ten minutes, it should really start getting some good golden color.",
        "stamp": 306356
    },
    {
        "text": "But given that there's so many different sizes, types and temperatures on grills, you may have to slightly increase or decrease the heat and or cook time to achieve the same color.",
        "stamp": 315572
    },
    {
        "text": "I also know you may be tempted to add the chicken to the direct heat side, but if you do, you may get three or four nice grill lines along with some big flames as the fat drips down into the grill.",
        "stamp": 325000
    },
    {
        "text": "But the rest of the chicken skin will be undercooked and not crispy, so trust me, low and slow is how you get the best all over golden color on the skin like this.",
        "stamp": 335858
    },
    {
        "text": "To double check that your chicken is cooked through, use an instant reed thermometer and it should reach about 160 to 165 degrees Fahrenheit.",
        "stamp": 345808
    },
    {
        "text": "Now you can slather the barbecue sauce all over the chicken and what you want to do is make sure there's a nice coat on the top side.",
        "stamp": 354134
    },
    {
        "text": "Don't worry about flipping it just yet.",
        "stamp": 362020
    },
    {
        "text": "You actually want to let the barbecue sauce sort of dry out on the top side of the chicken and I'll usually cook it for another three to four minutes with the lid closed again.",
        "stamp": 363940
    },
    {
        "text": "When you open the lid, the chicken will start to look like the barbecue chicken you know and love with that deep dark color.",
        "stamp": 372648
    },
    {
        "text": "Now you can flip the chicken and coat the other side with barbecue sauce and repeat this process again, cooking it for a few minutes each time with the lid closed.",
        "stamp": 379228
    },
    {
        "text": "Keep repeating this process until the chicken registers 170 to 175 degrees Fahrenheit on your instant read.",
        "stamp": 389210
    },
    {
        "text": "Thermometer bone in chicken meat needs to cook to a higher temperature to be fall off the bone tender.",
        "stamp": 395792
    },
    {
        "text": "When you're done, you will have the most gorgeous looking barbecue chicken and your patience on the grill will be rewarded with raving applause from all who eat your soon to be famous grilled barbecue chicken recipe.",
        "stamp": 402190
    },
    {
        "text": "Trust me, you will get put on grilling duty for all outdoor parties and barbecues in the future as well.",
        "stamp": 414590
    },
    {
        "text": "You use your tongs to move the chicken to a serving plate and if you'd like, you can always slather on a bit more sauce or serve the sauce in a separate container alongside the chicken on a buffet table.",
        "stamp": 425750
    },
    {
        "text": "I'm going to take my barbecue chicken back inside so I don't get sunburned today and I'm just going to dig on in because there's really no graceful way to eat barbecue chicken other than to just have at it.",
        "stamp": 444030
    },
    {
        "text": "I hope you enjoyed today's video and if you did, make sure to give it a thumbs up and share it with your family and friends who also love tasty grilling recipes.",
        "stamp": 455490
    },
    {
        "text": "And I will see you again in the next video.",
        "stamp": 463850
    }
]
}
